Table of Contents
 Enum CountryCode
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
CountryCode
public enum CountryCode
Fields
American = 8
American design code as ACI, AISC, ASTM standards etc.
Australia = 10
Australian design code
CHN = 12
China design code
Canada = 9
Canadian design code
ECEN = 1
Eurocode
HKG = 13
Hong Kong design code
India = 5
India code
None = 0
no code
RUS = 11
Russia design code
SIA = 6
Swiss code
Fields
 Name |  Description
 American = 8
American design code as ACI, AISC, ASTM standards etc.
 Australia = 10
Australian design code
 CHN = 12
China design code
 Canada = 9
Canadian design code
 ECEN = 1
Eurocode
 HKG = 13
Hong Kong design code
 India = 5
India code
 None = 0
no code
 RUS = 11
Russia design code
 SIA = 6
Swiss code
 Edit this page